# IFCCategory Template Get Mapping Info By Id Method

Source: https://www.revitapidocs.com/2026/9304b014-4d75-7ace-6a31-bea372c9f5d7.htm

---

| IFCCategory Template Get Mapping Info By Id Method |
| --- |

Gets a copy of IFC mapping info by category id.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ExportIFCCategoryInfo GetMappingInfoById(
	Document document,
	ElementId categoryId,
	CustomSubCategoryId customSubCategoryId
)
```

```
Public Function GetMappingInfoById (
	document As Document,
	categoryId As ElementId,
	customSubCategoryId As CustomSubCategoryId
) As ExportIFCCategoryInfo
```

```
public:
ExportIFCCategoryInfo^ GetMappingInfoById(
	Document^ document,
	ElementId^ categoryId,
	CustomSubCategoryId customSubCategoryId
)
```

```
member GetMappingInfoById :
        document : Document *
        categoryId : ElementId *
        customSubCategoryId : CustomSubCategoryId -> ExportIFCCategoryInfo
```

#### Parameters

document Document
:   A Revit document.

categoryId ElementId
:   The category id.

customSubCategoryId CustomSubCategoryId
:   The custom subcategory id.

#### Return Value

ExportIFCCategoryInfo
Return the info for this category. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace